[["What type of problem is it?",[["Computer won't start",1],["Internet Problem",2],["Printer Problem",3],["Windows gives startup error",4],["Computer is very slow",5]]],
["Is your computer plugged in to a working outlet and is the power supply on?",[6,7]],
["What does your IP address start with?",[["Help",15],["169.254.x.x",20],["10.x.x.x",25],["172.x.x.x",25],["192.x.x.x",25],["Other IP",25,0]]],
["Can you print from your application?",[16,17]],
["Reboot. Does the error persist?", [29,-2]],
"UNUSED",
["Do the fans spin or does it light up when you turn it on?",[8,9]],
"Plug in your computer to a working outlet, and flip the switch on the power supply to the \"-\", if it has a switch",
["Does the computer beep more than once when it starts up?",[10,11]],
"Buy a new power supply (or ask a repair shop to inspect cabling or dust]",
"The beeping represents a \"POST Code\" and can be any type of hardware error, such as missing parts. You may need to take it to a technician. If you want to fix it yourself, look up the POST codes for your motherboard.",
["Is your monitor on and SECURELY plugged in to the computer?",[12,13]],
["If you have a video card, is your monitor plugged into your video card?",[-1,14]],
"Plug monitor into your computer. If the cable has screws, make sure they are screwed in. Also, power on your monitor by plugging it in then pressing the power button.",
"Plug your monitor into your video card. This is because \"onboard graphics\" are disabled when you have a video card.",
"(Press back once you get your IP address] An IP address is like a computer phone number, and computers need one to connect to the internet. On windows get your IP address by searching and running \"CMD\", then after a black window appears, type \"ipconfig\" and then enter. It will give you a line \"IP Address\" and on that will be your IP address. On Linux, search and run \"terminal\", then after the window appears, type \"ifconfig\". Then where it says \"inet addr:a.b.c.d\" is your IP address. If it starts with 255 or 127 it is not the one you are looking for.",
"Success, you can print.",
["Can you print a test page using the OS?", [18,19]],
"The application can’t connect to the program. Troubleshoot the application and check you have the right printer selected",
["Can you print a test page using controls at the printer? (Usually a button with a piece of paper]", [20,21]],
["Check the printer is connected to the PC and are the correct drivers installed (Advanced]. If that doesn’t work, Can you print with a different printer and printer cable from this PC?",[24,26]],
["Check power to the printer. Try turning the printer off and on again. Now can you print a test page by the controls at the printer?",[22,23]],
"Troubleshoot the printer. Check it has ink/toner, paper, and power. It may need repair.",
"Turn the printer online. If the problem persisits, restart the questions.",
"Try a new printer cable.",
"UNUSED",
["Do the printer and cable work with a different PC?",[27,28]],
"Your computer hardware could be unable to connect to the printer. Troubleshoot PC, including printer port and OS.",
"Multiple printer problems. Try troubleshooting the PC with a known good printer and cable",
["Is there an error message, QR code, or error code?",[30,31]],
["Look up the error code, and how to fix it. Has this fixed your problem?", [-2,31]],
["Safely boot your operating system. (In Windows, hold F5 while booting]. Can you fix the error?",[-2,32]],
"Get a startup disk for Windows and boot from it. Go to the recover option, and see if it can fix your PC."]